БухЭксп/Catalogs/CW_РеестрыНДС0СоответствиеЗаполненияСтрок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_РеестрыНДС0СоответствиеЗаполненияСтрок</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приказ</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_РеестрыНДС0ЯчейкиПриложений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеПриказа</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_РеестрыНДС0ЯчейкиПриложений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_РеестрыНДС0Приложения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакСтроки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_РеестрыНДС0ПризнакСтрокиПриложения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиСтрок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЯчейкаОтчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_РеестрыНДС0ЯчейкиПриложений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеЯчейки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_РеестрыНДС0АлгоритмыЗаполненияЯчеекОтчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеСтроки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СоответствияЗаполненияСтрок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_РеестрыНДС0СоответствиеЗаполненияСтрок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УсловиеВыполнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Enums/CW_РеестрыНДС0ПризнакСтрокиПриложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_РеестрыНДС0ПризнакСтрокиПриложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновнаяСтрока</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительнаяСтрока</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/ChartsOfCharacteristicTypes/CW_РеестрыНДС0ЯчейкиПриложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>CW_РеестрыНДС0ЯчейкиПриложений</Name>
			<Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>16</v8:Digits>
					<v8:FractionDigits>2</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>150</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяЯчейки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКолонки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаНалоговаяБаза</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаНумерации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеПоВидуТранспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_РеестрыНДС0Приложения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяДополнительныеСтроки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПримечание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

БухЭксп/Catalogs/CW_РеестрыНДС0СоответствиеЗаполненияСтрок/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	СписокПриказов = ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.ПолучитьСписокПриказов(); 
	Элементы.Приказ.СписокВыбора.ЗагрузитьЗначения(СписокПриказов.ВыгрузитьЗначения()); 
	
	Если Элементы.Приказ.СписокВыбора.Количество() = 1 Тогда 
		Объект.Приказ = Элементы.Приказ.СписокВыбора.Получить(0);
		Элементы.Приказ.ТолькоПросмотр = Истина;
	КонецЕсли;  
	
	УстановитьСписокВыбораПриложенийНаСервере();
	УстановитьВидимостьДополнительныхСтрок();
	
КонецПроцедуры    

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗаполнитьДополнительныеКолонки();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьДополнительныеКолонки();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеКолонки()
	
	Для Каждого СтрокаНастроек из Объект.НастройкиСтрок Цикл
		СтрокаНастроек.ЯчейкаНалоговаяБаза = СтрокаНастроек.ЯчейкаОтчета.ЯчейкаНалоговаяБаза;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриказПриИзменении(Элемент) 
	
	УстановитьСписокВыбораПриложенийНаСервере();
	ПриказПриИзмененииНаСервере(); 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСписокВыбораПриложенийНаСервере()
	
	МассивПриложений = CW_РеестрыНДС0Сервер.ПолучитьСписокВыбораВидаТранспортаПоПриказу(Объект.Приказ); 
	Элементы.Приложение.СписокВыбора.ЗагрузитьЗначения(МассивПриложений);
	
КонецПроцедуры
	
	
&НаСервере
Процедура ПриказПриИзмененииНаСервере()  
	
	Если Элементы.Приложение.СписокВыбора.Количество() = 1 Тогда
		СтрокаСписка = Элементы.Приложение.СписокВыбора.Получить(0);
		Объект.Приложение = СтрокаСписка.Значение;
	КонецЕсли;
	
	Если Объект.Приложение.Пустая() Тогда
		Объект.НастройкиСтрок.Очистить();
		Объект.ДополнительныеСтроки.Очистить();   
	Иначе
		ПриложениеПриИзмененииНаСервере();
	КонецЕсли;   
	
КонецПроцедуры


&НаКлиенте
Процедура НастройкиСтрокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры   

&НаКлиенте
Процедура НастройкиСтрокПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры 

&НаКлиенте
Процедура ПриложениеПриИзменении(Элемент)
	ПриложениеПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриложениеПриИзмененииНаСервере() 
	
	Объект.ПриложениеПриказа = CW_РеестрыНДС0Сервер.ПолучитьПриложениеПриказа(Объект.Приказ, Объект.Приложение);
	Если Объект.ПриложениеПриказа.Пустая() Тогда
		Возврат;	
	КонецЕсли;
	
	Объект.НастройкиСтрок.Очистить();
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_РеестрыНДС0ЯчейкиПриложений.Ссылка КАК ЯчейкаОтчета,
	               |	CW_РеестрыНДС0ЯчейкиПриложений.ИмяЯчейки КАК ИмяЯчейки,
	               |	CW_РеестрыНДС0ЯчейкиПриложений.НомерКолонки КАК НомерКолонки,
	               |	CW_РеестрыНДС0ЯчейкиПриложений.ЯчейкаНалоговаяБаза КАК ЯчейкаНалоговаяБаза
	               |ИЗ
	               |	ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений КАК CW_РеестрыНДС0ЯчейкиПриложений
	               |ГДЕ
	               |	CW_РеестрыНДС0ЯчейкиПриложений.Родитель = &Родитель
	               |	И CW_РеестрыНДС0ЯчейкиПриложений.ЭтоГруппа = ЛОЖЬ
	               |	И CW_РеестрыНДС0ЯчейкиПриложений.ЯчейкаНумерации = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	CW_РеестрыНДС0ЯчейкиПриложений.Код
	               |АВТОУПОРЯДОЧИВАНИЕ";   
	
	Запрос.УстановитьПараметр("Родитель", Объект.ПриложениеПриказа);   
	
	РезультатЗапроса = Запрос.Выполнить(); 

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.НастройкиСтрок.Добавить();
		НоваяСтрока.ЯчейкаОтчета 		= Выборка.ЯчейкаОтчета;
		НоваяСтрока.ЯчейкаНалоговаяБаза = Выборка.ЯчейкаНалоговаяБаза;
	КонецЦикла;  
	
	УстановитьВидимостьДополнительныхСтрок();
	
КонецПроцедуры  


&НаКлиенте
Процедура ДополнительныеСтрокиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.ГиперссылкаЯчейки Тогда  
		
		СтандартнаяОбработка = Ложь;     
		
		ТекущаяСтрока = Элементы.ДополнительныеСтроки.ТекущаяСтрока;   
		СтрокаТекущая = Объект.ДополнительныеСтроки.НайтиПоИдентификатору(ТекущаяСтрока);

		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ТекущаяСтрока", ТекущаяСтрока);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьВводУсловия", ЭтотОбъект, ДополнительныеПараметры);
		
		ПоказатьВводСтроки(ОписаниеОповещения, СтрокаТекущая.УсловиеВыполнения,"Введите текст условия выполнения",0, Истина);
		
	КонецЕсли;
	

КонецПроцедуры 

&НаКлиенте
Процедура ЗавершитьВводУсловия(Строка, ДополнительныеПараметры) Экспорт 
	
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТекущая = Объект.ДополнительныеСтроки.НайтиПоИдентификатору(ДополнительныеПараметры.ТекущаяСтрока);
	СтрокаТекущая.УсловиеВыполнения = Строка;
	
КонецПроцедуры

&наСервере
Функция УстановитьВидимостьДополнительныхСтрок()
	
	Элементы.ГруппаДополнительнаяНастрйока.Видимость = Объект.ПриложениеПриказа.ИспользуютсяДополнительныеСтроки 
				И Объект.ПризнакСтроки = ПредопределенноеЗначение("Перечисление.CW_РеестрыНДС0ПризнакСтрокиПриложения.ОсновнаяСтрока");
	
КонецФункции

&НаКлиенте
Процедура ПризнакСтрокиПриИзменении(Элемент) 
	
	УстановитьВидимостьДополнительныхСтрок(); 
	
КонецПроцедуры
